martonmiklos/nrf51822-altimeter-fw/altimeter_service.c

#include <stdint.h>
#include <string.h>
#include "nrf_gpio.h"
#include "altimeter_service.h"
#include "ble_srv_common.h"
#include "app_error.h"
#include "app_timer.h"

static uint8_t rudder_value, motor_value, charge_value = 42;
extern uint16_t pwmA, pwmB;
extern const app_timer_id_t m_motors_halt_timer_id;

/**@brief Function for handling BLE GATTS EVENTS
 * 
 * This function prints out data that is received when you try to write to your characteristic or CCCD. 
 * In general it is a bad idea to do so much printf stuff and UART transfer inside the BLE handler,
 * but this is just for demonstrate purposes.
 *
 * @param[in]   p_our_service        Our Service structure.
 * @param[in]   p_ble_evt            BLE event passed from BLE stack
 *
 */
static void on_ble_write(ble_os_t * p_our_service, ble_evt_t * p_ble_evt)
{
    // Declare buffer variable to hold received data. The data can only be 32 bit long.
    uint8_t data_buffer;
    // Populate ble_gatts_value_t structure to hold received data and metadata.
    ble_gatts_value_t rx_data;
    rx_data.len = sizeof(uint8_t);
    rx_data.offset = 0;
    rx_data.p_value = (uint8_t*)&data_buffer;
    
    // Check if write event is performed on our characteristic or the CCCD
    if(p_ble_evt->evt.gatts_evt.params.write.handle == p_our_service->char_handles.value_handle)
    {
        // Get data
        sd_ble_gatts_value_get(p_our_service->conn_handle, p_our_service->char_handles.value_handle, &rx_data);
        // Print handle and value 
        printf("Value received on handle %#06x: %#010x\r\n", p_ble_evt->evt.gatts_evt.params.write.handle, data_buffer);
    }
    else if(p_ble_evt->evt.gatts_evt.params.write.handle == p_our_service->char_handles.cccd_handle)
    {
        // Get data
        sd_ble_gatts_value_get(p_our_service->conn_handle, p_our_service->char_handles.cccd_handle, &rx_data);
        // Print handle and value 
        // FIXMEprintf("Value received on handle %#06x: %#06x\r\n", p_ble_evt->evt.gatts_evt.params.write.handle, data_buffer);
    }
    else if(p_ble_evt->evt.gatts_evt.params.write.handle == p_our_service->motor_handles.value_handle)
    {
        sd_ble_gatts_value_get(p_our_service->conn_handle, p_our_service->motor_handles.value_handle, &rx_data);
        // FIXME pwmA = data_buffer;
        // FIXME app_timer_stop(m_motors_halt_timer_id);
        // FIXME app_timer_start(m_motors_halt_timer_id, APP_TIMER_TICKS(200, APP_TIMER_PRESCALER), NULL);
    }
    else if(p_ble_evt->evt.gatts_evt.params.write.handle == p_our_service->rudder_handles.value_handle)
    {
        sd_ble_gatts_value_get(p_our_service->conn_handle, p_our_service->rudder_handles.value_handle, &rx_data);
        // FIXMEpwmB = data_buffer;
        // FIXME app_timer_stop(m_motors_halt_timer_id);
        // FIXMEapp_timer_start(m_motors_halt_timer_id, APP_TIMER_TICKS(200, APP_TIMER_PRESCALER), NULL);
    }
}

// ALREADY_DONE_FOR_YOU: Declaration of a function that will take care of some housekeeping of ble connections related to our service and characteristic
void ble_plane_service_on_ble_evt(ble_os_t * p_service, ble_evt_t * p_ble_evt)
{

    // OUR_JOB: Step 3.D Implement switch case handling BLE events related to our service. 
    switch (p_ble_evt->header.evt_id)
    {        
        case BLE_GATTS_EVT_WRITE:
            on_ble_write(p_service, p_ble_evt);
            break;
        case BLE_GAP_EVT_CONNECTED:
            p_service->conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            break;
        case BLE_GAP_EVT_DISCONNECTED:
            p_service->conn_handle = BLE_CONN_HANDLE_INVALID;
            break;
        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for adding our new characterstic to "Our service" that we initiated in the previous tutorial. 
 *
 * @param[in]   p_our_service        Our Service structure.
 *
 */
static uint32_t plane_characteristic_add(ble_os_t * p_service)
{
    uint32_t   err_code = 0; // Variable to hold return codes from library and softdevice functions
    
    // OUR_JOB: Step 2.A, Add a custom characteristic UUID
    ble_uuid_t          motor_char_uuid;
    ble_uuid128_t       motor_uuid = BLE_UUID_POWERUP_SERVICE_BASE_UUID;
    motor_char_uuid.uuid      = BLE_UUID_POWERUP_MOTOR;
    sd_ble_uuid_vs_add(&motor_uuid, &motor_char_uuid.type);
    APP_ERROR_CHECK(err_code);

    ble_uuid_t          rudder_char_uuid;
    ble_uuid128_t       rudder_uuid = BLE_UUID_POWERUP_SERVICE_BASE_UUID;
    rudder_char_uuid.uuid      = BLE_UUID_POWERUP_RUDDER;
    sd_ble_uuid_vs_add(&rudder_uuid, &rudder_char_uuid.type);
    APP_ERROR_CHECK(err_code);

    ble_uuid_t          charge_char_uuid;
    ble_uuid128_t       charge_uuid = BLE_UUID_POWERUP_SERVICE_BASE_UUID;
    charge_char_uuid.uuid      = BLE_UUID_POWERUP_CHARGE;
    sd_ble_uuid_vs_add(&charge_uuid, &charge_char_uuid.type);
    APP_ERROR_CHECK(err_code);


    // OUR_JOB: Step 2.F Add read/write properties to our characteristic
    ble_gatts_char_md_t char_md;
    memset(&char_md, 0, sizeof(char_md));
    char_md.char_props.read = 1;
    char_md.char_props.write = 1;

    // OUR_JOB: Step 3.A, Configuring Client Characteristic Configuration Descriptor metadata and add to char_md structure
    ble_gatts_attr_md_t cccd_md;
    memset(&cccd_md, 0, sizeof(cccd_md));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);
    cccd_md.vloc                = BLE_GATTS_VLOC_STACK;    
    char_md.p_cccd_md           = &cccd_md;
    char_md.char_props.notify   = 0;
    
    // OUR_JOB: Step 2.B, Configure the attribute metadata
    ble_gatts_attr_md_t attr_md;
    memset(&attr_md, 0, sizeof(attr_md));
    attr_md.vloc        = BLE_GATTS_VLOC_STACK;

    
    // OUR_JOB: Step 2.G, Set read/write security levels to our characteristic
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);

    
    // OUR_JOB: Step 2.C, Configure the characteristic value attribute
    ble_gatts_attr_t    attr_char_value;
    memset(&attr_char_value, 0, sizeof(attr_char_value));        
    attr_char_value.p_attr_md   = &attr_md;
    
    // OUR_JOB: Step 2.H, Set characteristic length in number of bytes
    attr_char_value.max_len     = 1;
    attr_char_value.init_len    = 1;

    attr_char_value.p_value     = &motor_value;
    attr_char_value.p_uuid      = &motor_char_uuid;
    err_code = sd_ble_gatts_characteristic_add(p_service->service_handle,
                                       &char_md,
                                       &attr_char_value,
                                       &p_service->motor_handles);

    attr_char_value.p_value     = &rudder_value;
    attr_char_value.p_uuid      = &rudder_char_uuid;
    err_code = sd_ble_gatts_characteristic_add(p_service->service_handle,
                                       &char_md,
                                       &attr_char_value,
                                       &p_service->rudder_handles);

    char_md.char_props.write = 0;
    attr_char_value.p_value     = &charge_value;
    attr_char_value.p_uuid      = &charge_char_uuid;
    err_code = sd_ble_gatts_characteristic_add(p_service->service_handle,
                                       &char_md,
                                       &attr_char_value,
                                       &p_service->char_handles);
    APP_ERROR_CHECK(err_code);
    
    return NRF_SUCCESS;
}


/**@brief Function for initiating our new service.
 *
 * @param[in]   p_our_service        Our Service structure.
 *
 */
void plane_service_init(ble_os_t * p_our_service)
{
    uint32_t   err_code; // Variable to hold return codes from library and softdevice functions

    // FROM_SERVICE_TUTORIAL: Declare 16-bit service and 128-bit base UUIDs and add them to the BLE stack
    ble_uuid_t        service_uuid;
    ble_uuid128_t     base_uuid = BLE_UUID_POWERUP_SERVICE_BASE_UUID;
    service_uuid.uuid = BLE_UUID_POWERUP_SERVICE;
    err_code = sd_ble_uuid_vs_add(&base_uuid, &service_uuid.type);
    APP_ERROR_CHECK(err_code);    
    
    // OUR_JOB: Step 3.B, Set our service connection handle to default value. I.e. an invalid handle since we are not yet in a connection.
    p_our_service->conn_handle = BLE_CONN_HANDLE_INVALID;

    // FROM_SERVICE_TUTORIAL: Add our service
    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
                                        &service_uuid,
                                        &p_our_service->service_handle);
    
    APP_ERROR_CHECK(err_code);
    
    // OUR_JOB: Call the function our_char_add() to add our new characteristic to the service. 
    plane_characteristic_add(p_our_service);
}

ret_code_t plane_pwm_channel_duty_set(app_pwm_t const * const p_instance,
                                  uint8_t channel, app_pwm_duty_t duty)
{
    uint32_t ticks = ((uint32_t)app_pwm_cycle_ticks_get(p_instance) * (uint32_t)duty) / 255UL;
    return app_pwm_channel_duty_ticks_set(p_instance, channel, ticks);
}
